Strogino/src/Documents/Приходная/Приходная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Приходная</name>
  <basedOn>Document.Инвентаризация</basedOn>
  <registerRecords>AccumulationRegister.Претензии</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТовара</registerRecords>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНакладной</name>
    <type>
      <types>EnumRef.ТипыПрихНакл</types>
    </type>
  </attributes>
  <attributes>
    <name>ВычНП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетОтСуммы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОснования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БезЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоставщика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДСПоставщика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВведенАвтоматическиПоПретензии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Упрощенка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПриходнойНакладной</name>
    <type>
      <types>EnumRef.СтатусПриходнойНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриемПодЗаказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентПодЗаказ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПускаВПродажу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвторПускаВПродажу</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС10</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС20</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оплачено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма0</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма10</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма20</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСЧФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрдернаяСхема</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенаПриемка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладТранзит</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Фирма</name>
    <type>
      <types>CatalogRef.Фирмы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.Партии</types>
      </type>
    </attributes>
    <attributes>
      <name>Имп</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаценкаПоставщика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГоденДо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПроизводителя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеестроваяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаценкаПроизводителя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаценкаРеестра</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СертификатДо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выдан</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Недовоз</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Перевоз</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Брак</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Лишний</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Претензия</name>
      <type>
        <types>CatalogRef.Претензии</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияПретензии</name>
      <type>
        <types>CatalogRef.Партии</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>CatalogRef.Производители</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказаПоставщику</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДеленнаяПозиция</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>БракованнаяСерия</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ШК_Ovh_list</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Strogino/src/AccumulationRegisters/Претензии/Претензии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Претензии</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.Партии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Претензия</name>
    <type>
      <types>CatalogRef.Претензии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПретензии</name>
    <type>
      <types>DocumentRef.Претензия</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Strogino/src/Enums/ТипыПрихНакл/ТипыПрихНакл.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПрихНакл</name>
  <enumValues>
    <name>Закупка</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
</mdclass:Enum>

Strogino/src/Catalogs/Претензии/Претензии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Претензии</name>
  <predefined>
    <items>
      <name>Брак</name>
      <description>Брак</description>
    </items>
    <items>
      <name>ВозвратПоставщику</name>
      <description>Возврат поставщику</description>
    </items>
    <items>
      <name>Лишний</name>
      <description>Лишний</description>
    </items>
    <items>
      <name>Недовоз</name>
      <description>Недовоз</description>
    </items>
    <items>
      <name>Перевоз</name>
      <description>Перевоз</description>
    </items>
  </predefined>
  <attributes>
    <name>ФормироватьДвижения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещатьПоставщика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Strogino/src/Catalogs/ЦеныПартии/ЦеныПартии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЦеныПартии</name>
  <owners>Catalog.Партии</owners>
  <attributes>
    <name>ТипЦены</name>
    <type>
      <types>CatalogRef.ТипЦены</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегионРаботы</name>
    <type>
      <types>CatalogRef.РегионРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПереоценки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

Strogino/src/Documents/Приходная/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи)
	СсылкаНовая = неопределено;
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		Если ЭтоНовый() тогда
			УИД = Новый УникальныйИдентификатор;
			СсылкаНовая = Документы.Приходная.ПолучитьСсылку(УИД);
			ЭтотОбъект.УстановитьСсылкуНового(СсылкаНовая);
			ЭтотОбъект.УстановитьНовыйНомер();
		КонецЕсли;
		НачатьТранзакцию();
		Попытка
			Для каждого строка из Товары цикл
				Если Не ЗначениеЗаполнено(Строка.Товар) тогда
					Продолжить;
				КонецЕсли;
				
				ПартияУжеБыла = Ложь;
				Если Не ЗначениеЗаполнено(Строка.Партия) тогда
					Партия = Справочники.Партии.СоздатьЭлемент();
					Партия.Владелец = Строка.Товар;
					//Если Партия.Код < 10 тогда
					//	Партия.Код = 10;
					//КонецЕсли;
					Если Строка.Товар.Обязательный тогда
						Строка.Имп = 2;
					Иначе
						Строка.Имп = 0;
					КонецЕсли;
				Иначе
					Партия = Строка.Партия.ПолучитьОбъект();
					Если Партия.ПометкаУдаления тогда
						Партия.УстановитьПометкуУдаления(Ложь);
					КонецЕсли;
					Если Партия.Владелец <> Строка.Товар тогда
						Сообщить("Владелец партии и товар не совпадают! "+Строка.Товар.Наименование);
						Отказ = Истина;
						Возврат;
					КонецЕсли;
					ПартияУжеБыла = Истина;	
				КонецЕсли;
				Если НЕ ПартияУжеБыла или (ПартияУжеБыла и ТипНакладной = Перечисления.ТипыПрихНакл.Закупка) тогда
					Партия.Документ = ?(ЗначениеЗаполнено(СсылкаНовая),СсылкаНовая,Ссылка);
					Партия.Наименование = СокрЛП(Строка(Номер))+" от " + Формат(Дата,"ДФ=dd.MM.yyyy")+"; "+Клиент.Наименование;
					Партия.Серия = Строка.Серия;
					Партия.ГоденДо = Строка.ГоденДо;
					Партия.РеестроваяЦена = Строка.РеестроваяЦена;
					Партия.ЦенаПроизводителя = Строка.ЦенаПроизводителя;
					Партия.ЗакупочнаяЦена = Строка.Цена;
					//Если ТипНакладной = Перечисления.ТипыПрихНакл.Закупка тогда
					//	Партия.ШтрихКод = Справочники.Партии.ПолучитьШтрихКодПартии();
					//КонецЕсли;
					Партия.Сертификат = Строка.Сертификат;
					Партия.СертификатДо = Строка.СертификатДо;
					Партия.Выдан = Строка.Выдан;
					Партия.Производитель = Строка.Производитель;
					Партия.НомерГТД = Строка.НомерГТД;
					Если (Строка.Цена*Строка.Количество)-Строка.СуммаНДС <> 0 тогда
						ПроцНДСПост = Окр((Строка.СуммаНДС/((Строка.Цена*Строка.Количество)-строка.СуммаНДС))*100,0);
						Партия.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоРеквизиту("Ставка",ПроцНДСПост);
					КонецЕсли;
					Партия.Фирма = Фирма;
					Партия.Записать();
				КонецЕсли;
				Строка.Партия = Партия.Ссылка;				
			КонецЦикла;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			Сообщение = новый СообщениеПользователю();
			Сообщение.Текст = "Не удалось записать документ по причине:"+символы.ПС + ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ОтделПретензий = ОбщиеФункцииСервер.ПолучитьОтделПретензий(Отдел);
	//Претензии

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриходнаяТовары.ПартияПретензии,
	|	ПриходнаяТовары.Претензия
	|ПОМЕСТИТЬ втПретензииБезПустых
	|ИЗ
	|	Документ.Приходная.Товары КАК ПриходнаяТовары
	|ГДЕ
	|   ПриходнаяТовары.Ссылка = &Ссылка
	|	И ПриходнаяТовары.ПартияПретензии <> ЗНАЧЕНИЕ(Справочник.Партии.ПустаяСсылка)
	|	И ПриходнаяТовары.Претензия <> ЗНАЧЕНИЕ(Справочник.Претензии.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПретензииОстатки.Склад,
	|	ПретензииОстатки.Партия КАК ПартияПретензии,
	|	ПретензииОстатки.Претензия,
	|	ПретензииОстатки.ДокументПретензии,
	|	ПретензииОстатки.СуммаОстаток КАК Сумма,
	|	ПретензииОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.Претензии.Остатки(
	|			&Дата,
	|			(Партия, Претензия) В
	|				(ВЫБРАТЬ
	|					втПретензииБезПустых.ПартияПретензии,
	|					втПретензииБезПустых.Претензия
	|				ИЗ
	|					втПретензииБезПустых КАК втПретензииБезПустых)) КАК ПретензииОстатки";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("Дата",Новый Граница(МоментВремени(),ВидГраницы.Включая));

	ТЗОстатковПретензий = Запрос.Выполнить().Выгрузить();
	//ОстаткиТоваров
	Движения.ОстаткиТовара.Очистить();
	Движения.ОстаткиТовара.Записывать = Истина;
	Движения.Претензии.Очистить();
	Движения.Претензии.Записывать = Истина;
	Для Каждого строка из Товары Цикл
		
		КоличествоПоПретензии = Строка.Перевоз+Строка.Брак;
		
		Если КоличествоПоПретензии > 0 Тогда
			Движение = Движения.ОстаткиТовара.ДобавитьПриход();
			Движение.Товар = Строка.Товар;
			Движение.Период = Дата;
			Движение.Отдел = ОтделПретензий;
			Движение.Партия = Строка.Партия;
			Движение.Остаток = КоличествоПоПретензии;
			Движение.ТипОперации = Перечисления.ТипыОпераций.Закупка;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.ПартияПретензии) тогда
		//движения по РС Претензии
		КонецЕсли;
		Количество = Строка.Количество-Строка.Недовоз-Строка.Перевоз-Строка.Брак;
		Если Количество <= 0 тогда
			Продолжить;
		КонецЕсли;
		
		Если ВычНП и ОрдернаяСхема = 0 тогда
			Движение = Движения.ОстаткиТовара.ДобавитьПриход();
			Движение.Товар = Строка.Товар;
			Движение.Период = Дата;
			Движение.Отдел = Отдел;
			Движение.Партия = Строка.Партия;
			Движение.Остаток = Количество;
			Если ТипНакладной = Перечисления.ТипыПрихНакл.Закупка тогда
				Движение.ТипОперации = Перечисления.ТипыОпераций.Закупка;
			Иначе
				Движение.ТипОперации = Перечисления.ТипыОпераций.ВозвратПокупателя;
			КонецЕсли;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Строка.ПартияПретензии) тогда
			ОстаткиПоПартииПретензии = ТЗОстатковПретензий.Скопировать(Новый Структура("ПартияПретензии,Претензия",Строка.ПартияПретензии,Строка.Претензия));		
			КолП = Количество;
			Для каждого остаток из ОстаткиПоПартииПретензии цикл
				Кол = остаток.Количество;
				Сум = остаток.Сумма;
				Если Кол = 0 Тогда Продолжить КонецЕсли;
				СписатьКол = Мин(Кол, КолП);                                                                            
				Если СписатьКол = Кол Тогда
					СписатьСумму = остаток.Сумма;
				Иначе                                            
					СписатьСумму = СписатьКол*строка.ПартияПретензии.ЗакупочнаяЦена;
				КонецЕсли;
				Движение = Движения.Претензии.ДобавитьРасход();
				Движение.Партия=строка.ПартияПретензии;
				Движение.Претензия=строка.Претензия;
				Движение.Склад=остаток.Склад;  
				Движение.ДокументПретензии=остаток.ДокументПретензии;
				Движение.Количество=СписатьКол; 
				Движение.Сумма=СписатьСумму;
				Движение.Период = Дата;
				КолП = КолП-СписатьКол;  
				Если КолП=0 Тогда 
					Прервать 
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
		
	Если не ПометкаУдаления и Проведен и не ДополнительныеСвойства.Свойство("ЭтоОбмен") тогда
		Если (РазрешенаПриемка или Клиент = ПредопределенноеЗначение("Справочник.Контрагенты.Склад")) и не ОбменАлгоритмыРИБД.ЭтоЦентральнаяБаза() Тогда
			СоздатьЦеныПартии(Отказ);
		КонецЕсли;
		Если ВычНП и не ДополнительныеСвойства.Свойство("ЭтоОбмен") тогда
			Документы.Приходная.СоздатьПретензии(Ссылка);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьЦеныПартии(Отказ) Экспорт	
	
	Если РазрешенаПриемка тогда
		СтрокиСПустойПартией = Товары.НайтиСтроки(Новый Структура("Партия",Справочники.Партии.ПустаяСсылка()));
		Если СтрокиСПустойПартией.Количество() <> 0 тогда
			Сообщить("Не везде есть партии");
			Отказ = истина;
			Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;

	//Если ОрдернаяСхема = 1 и ТипНакладной <> перечисления.ТипыПрихНакл.ВводОстатков тогда
		ТаблицаНастроек = ОбщиеФункцииСервер.ПолучитьНастройкиСозданияЦенПартии(Отдел,Дата);
		Для каждого Строка из Товары цикл
			Для каждого Настройка из ТаблицаНастроек цикл
				Если Не ЗначениеЗаполнено(Строка.Партия) тогда
					Продолжить;
				КонецЕсли;
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЦеныПартии.Ссылка
				|ИЗ
				|	Справочник.ЦеныПартии КАК ЦеныПартии
				|ГДЕ
				|	ЦеныПартии.Владелец = &Владелец
				|	И ЦеныПартии.ТипЦены = &ТипЦены
				|	И ЦеныПартии.РегионРаботы = &РегионРаботы";
				Запрос.УстановитьПараметр("ТипЦены",Настройка.ТипЦены);
				Запрос.УстановитьПараметр("РегионРаботы",Настройка.РегионРаботы);
				Запрос.УстановитьПараметр("Владелец",Строка.Партия);
				Выборка = Запрос.Выполнить().Выбрать();
				ЦенаПартии = Справочники.ЦеныПартии.ПустаяСсылка();
				Пока Выборка.Следующий() цикл
					ЦенаПартии = Выборка.Ссылка;
				КонецЦикла;
				//ЦеныПартии = Справочники.ЦеныПартии.НайтиПоРеквизиту("ТипЦены",Настройка.ТипЦены,,Строка.Партия);
				Если не ЗначениеЗаполнено(ЦенаПартии) тогда
					ЦПП=ОбщиеФункцииСервер.ЦенаПоследнейПартии(Строка.Товар,Настройка.ТипЦены,Настройка.РегионРаботы);
					ЦеныПартии = Справочники.ЦеныПартии.СоздатьЭлемент();
					ЗаполнитьЗначенияСвойств(ЦеныПартии,Настройка);
					ЦеныПартии.Владелец = Строка.Партия;
					ВычЦенаПартии = ОбщиеФункцииСервер.РасчетЦеныПартии(Настройка.ТипЦены, Строка.Товар,Дата,Строка.Цена,ЦПП,Строка.РеестроваяЦена,Строка.ЦенаПроизводителя,Строка.Партия.СтавкаНДС.Ставка,Клиент,Настройка.РегионРаботы);
					Если ВычЦенаПартии < Строка.Цена тогда
						Если Строка.РеестроваяЦена>0 тогда
							ВычЦенаПартии = Строка.Цена;
						Иначе
							Если ВычЦенаПартии<>0.01 тогда
								ВычЦенаПартии = цел(Строка.Цена*1.04)+1;
							КонецЕсли;
						КонецЕсли;		
					КонецЕсли;
					ЦеныПартии.Цена = ВычЦенаПартии;
					ЦеныПартии.Записать();
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	//КонецЕсли;
	Возврат;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Инвентаризация") Тогда
		Товары.Очистить();
		Если не ЗначениеЗаполнено(Дата) тогда
			Дата =  ДанныеЗаполнения.Дата;
		КонецЕсли;
		Отдел = ДанныеЗаполнения.Склад;
		Фирма = ДанныеЗаполнения.Склад.АдресХранения.Фирма;
		Клиент = Справочники.Контрагенты.Склад;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Для каждого Строка из ДанныеЗаполнения.ПриходПоТоварам цикл
			Стр = Товары.Добавить();	
			ЗаполнитьЗначенияСвойств(Стр,Строка);
			СтруктураСтроки = Новый Структура("Количество,Сумма,Цена,Недовоз,Перевоз,Брак");
			ЗаполнитьЗначенияСвойств(СтруктураСтроки,Стр);
			ОбщиеФункцииСервер.РасчитатьСтрокуТЗТоварыСервер(СтруктураСтроки,РасчетОтСуммы);
			ЗаполнитьЗначенияСвойств(Стр,СтруктураСтроки);
			Если Упрощенка или не ЗначениеЗаполнено(Строка.СтавкаНДС)  тогда
				ПроцентНДС = 0;
			Иначе
				ПроцентНДС = Строка.СтавкаНДС.Ставка;
			КонецЕсли;
			Стр.СуммаНДС = Стр.Цена*Стр.Количество*ПроцентНДС/(100+ПроцентНДС); 
		КонецЦикла;	
	КонецЕсли;

КонецПроцедуры
